# InstMayCutMoreOrFewerHosts Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..InstMayCutMoreOrFewerHosts Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Insert may be cutting fewer or more hosts than needed. The problem may be solved by forcing regeneration, e.g. by moving the insert out and back by a tiny distance in any direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InstMayCutMoreOrFewerHosts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstMayCutMoreOrFewerHosts As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InstMayCutMoreOrFewerHosts {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace